/**
  ******************************************************************************
  * @file    
  * @author  
  * @version 
  * @date    
  * @brief   
  ******************************************************************************
  * @attention
  *
  * 
  * 
  * 
  * 
  * 
  * 
  *
  * 
  ******************************************************************************
  */
  
#ifndef __TASK_LED_H
#define __TASK_LED_H

/* Includes ------------------------------------------------------------------*/
/* Exported typedef -----------------------------------------------------------*/
/* Exported define ------------------------------------------------------------*/
/* Exported macro -------------------------------------------------------------*/
/* Exported variables ---------------------------------------------------------*/

/* Exported function prototypes -----------------------------------------------*/
/* Exported functions ---------------------------------------------------------*/
/**
	* @brief  通过队列led_queue_handle机制，配置LED1和LED2的闪烁频率。
	* @param  id LED的编码
	*     @arg  id=0，LED1；  id=1，LED2; 
	* @param  time 闪烁时间长度. 0-常灭; 65535-常灭。
	* @retval 无
	*/
void LedFlashConfig(unsigned char id, unsigned short time );

/**
	* @brief  LED控制任务
	* @param  p_parameters 传入函数的参数
	* @retval 返回值
	*/
void TaskLED(void * p_parameters);

#endif
