/**
  ******************************************************************************
  * @file    C文件 格式模板
  * @author  江苏鑫晨 控制产品部
  * @version V1.0.0
  * @date    2020-12-18
  * @brief   
  ******************************************************************************
  * @attention
  *
  * 
  * 公司内部建议统一格式风格，具体编程规范请参考《江苏鑫晨 嵌入式软件编程规范》 
	* 文本编码格式为 ANSI
  * 
  * 
  * 
  * 
  *
  * 
  ******************************************************************************
  */  

/* Includes ------------------------------------------------------------------*/
#include "Template.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/**
	* @brief  函数功能简要说明
	* @param  参数1简要说明
	*   This parameter can be one of the following values:
	*     @arg   如参数1可枚举, 可以逐个说明。
	* @param  参数2简要说明
	* @retval 返回值
	*/





/******************* (C) COPYRIGHT 2020 JSXC  *****END OF FILE****/
